/*বিসমিল্লাহির_রহমানির_রহীম
 Author: SOHAN
*/
///*****************************************************************************************
///***************START************************START************************START***********
///*****************************************************************************************

#include <iostream>
using namespace std;
int main()
{
    long long int n,d,x;
    cin>>n;
    while(d--)
    {
        cin >> x;
    }
    if(x<2)
    {
        cout<<0<<endl;
    }
    else if(x%2==0)
    {
        cout<<x/2<<endl;
    }
    else if(x%2!=0)
    {
        cout<<x/2-1<<endl;
    }
return 0;

}
